/*某公司有四个销售员(代号1—4)，负责销售五种产品(代号1—5)。每个销售员都把当天售出的每种产品各写一张便条交上来。
每张便条包含销售员的代号、产品的代号、这种产品的销售额。我们搜集到了每个月的所有便条，
你的任务是根据这些便条，计算出每人、每种产品的总销售额。处理完销售信息后，以表格形式打印出结果。
用列代表销售员，行代表产品。每种产品的销售总额输出到该行的最右边，每个销售员的销售总额输出到该列的最下边。
输入样例:
4
1 1 35.6
1 2 23.1
1 1 89.3
4 5 22.6
输出样例:
124.9	0.0	    0.0	    0.0	    124.9
23.1	0.0	    0.0	    0.0	    23.1
0.0	    0.0	    0.0	    0.0	    0.0
0.0	    0.0	    0.0	    0.0	    0.0
0.0	    0.0	    0.0	    22.6	22.6
148.0	0.0	    0.0	    22.6	170.6*/

#include<stdio.h>

int main()
{
    int tip[2];
    float money;
    int x,y,z,n;
    float chart[6][5]={0};
    scanf("%d",&n);
    for(y=0;y<n;y++)
    {
        for(x=0;x<2;x++)
            scanf("%d",&tip[x]);
        scanf("%f",&money);
        chart[tip[1]-1][tip[0]-1]+=money;
    }
    for(x=0;x<5;x++)
    {
        for(y=0;y<4;y++)
            chart[5][y]+=chart[x][y];
    }
    for(x=0;x<5;x++)
    {
        for(y=0;y<4;y++)
            chart[x][4]+=chart[x][y];
    }
    for(x=0;x<4;x++)
        chart[5][4]+=chart[5][x];
    for(x=0;x<6;x++)
    {
        for(y=0;y<5;y++)
        {
            if(y==0)
                printf("%.1f",chart[x][y]);
            else if(y<4)
                printf("\t%.1f",chart[x][y]);
            else if(y==4)
                printf("\t%.1f\n",chart[x][y]);
        }
    }
    return 0;
}