/*用'*'(星号)和'.'(点)空格打印如下图案。
输入格式:
只有一行为用空格分隔的三个整数，依次为l，c和n(0<l,c,n<20)。其中l和c分别代表格子的行数和列数；n代表格子内点的列数（格子内点的行数固定为3）。具体见输出样例。
输出格式:
根据给定的行列等参数输出图形（请看输出样例）。
输入样例:
2 5 2
输出样例:
****************
*..*..*..*..*..*
*..*..*..*..*..*
*..*..*..*..*..*
****************
*..*..*..*..*..*
*..*..*..*..*..*
*..*..*..*..*..*
****************
*/

#include<stdio.h>
int main()
{
    int l,c,n;
    int x,y,z,a,b;
    scanf("%d%d%d",&l,&c,&n);
    for(z=0;z<=(n+1)*c;z++)
        {
            printf("*");
        }
        printf("\n");
    for(x=0;x<l;x++)
    {
        for(a=0;a<3;a++)
        {
            printf("*");
            for(y=0;y<c;y++)
            {
                for(b=0;b<n;b++)
                {
                    printf(".");
                }
                printf("*");
            }
            printf("\n");
        }
        for(z=0;z<=(n+1)*c;z++)
        {
            printf("*");
        }
        printf("\n");
    }
    return 0;
}